In [ ]:
import pandas as pd
import numpy as np

In [10]:
df=pd.read_csv('house_data.csv')

In [11]:
df.shape

(21607, 8)

In [13]:
df.describe()

                 id         price  ...       sqft_lot     floors
count  9.900000e+01  9.900000e+01  ...      99.000000  99.000000
mean   4.664620e+09  5.200763e+05  ...   11478.818182   1.464646
std    2.935212e+09  3.061939e+05  ...   14655.249813   0.511363
min    1.600040e+07  1.530000e+05  ...    1044.000000   1.000000
25%    1.914950e+09  3.070000e+05  ...    5000.000000   1.000000
50%    4.036801e+09  4.300000e+05  ...    6720.000000   1.500000
75%    7.337325e+09  6.562500e+05  ...    9823.000000   2.000000
max    9.822700e+09  2.000000e+06  ...  101930.000000   3.000000

[8 rows x 7 columns]

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21607 entries, 0 to 21606
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           99 non-null     float64
 1   date         99 non-null     object
 2   price        99 non-null     float64
 3   bedrooms     99 non-null     float64
 4   bathrooms    99 non-null     float64
 5   sqft_living  99 non-null     float64
 6   sqft_lot     99 non-null     float64
 7   floors       99 non-null     float64
dtypes: float64(7), object(1)
memory usage: 1.3+ MB

In [15]:
df.head(10)

             id             date      price  ...  sqft_living  sqft_lot  floors
0  7.129301e+09  20141013T000000   221900.0  ...       1180.0    5650.0     1.0
1  6.414100e+09  20141209T000000   538000.0  ...       2570.0    7242.0     2.0
2  5.631500e+09  20150225T000000   180000.0  ...        770.0   10000.0     1.0
3  2.487201e+09  20141209T000000   604000.0  ...       1960.0    5000.0     1.0
4  1.954401e+09  20150218T000000   510000.0  ...       1680.0    8080.0     1.0
5  7.237550e+09  20140512T000000  1230000.0  ...       5420.0  101930.0     1.0
6  1.321400e+09  20140627T000000   257500.0  ...       1715.0    6819.0     2.0
7  2.008000e+09  20150115T000000   291850.0  ...       1060.0    9711.0     1.0
8  2.414600e+09  20150415T000000   229500.0  ...       1780.0    7470.0     1.0
9  3.793500e+09  20150312T000000   323000.0  ...       1890.0    6560.0     2.0

[10 rows x 8 columns]

In [17]:
df.tail()

       id date  price  bedrooms  bathrooms  sqft_living  sqft_lot  floors
21602 NaN  NaN    NaN       NaN        NaN          NaN       NaN     NaN
21603 NaN  NaN    NaN       NaN        NaN          NaN       NaN     NaN
21604 NaN  NaN    NaN       NaN        NaN          NaN       NaN     NaN
21605 NaN  NaN    NaN       NaN        NaN          NaN       NaN     NaN
21606 NaN  NaN    NaN       NaN        NaN          NaN       NaN     NaN

In [18]:
df

                 id             date     price  ...  sqft_living  sqft_lot  floors
0      7.129301e+09  20141013T000000  221900.0  ...       1180.0    5650.0     1.0
1      6.414100e+09  20141209T000000  538000.0  ...       2570.0    7242.0     2.0
2      5.631500e+09  20150225T000000  180000.0  ...        770.0   10000.0     1.0
3      2.487201e+09  20141209T000000  604000.0  ...       1960.0    5000.0     1.0
4      1.954401e+09  20150218T000000  510000.0  ...       1680.0    8080.0     1.0
...             ...              ...       ...  ...          ...       ...     ...
21602           NaN              NaN       NaN  ...          NaN       NaN     NaN
21603           NaN              NaN       NaN  ...          NaN       NaN     NaN
21604           NaN              NaN       NaN  ...          NaN       NaN     NaN
21605           NaN              NaN       NaN  ...          NaN       NaN     NaN
21606           NaN              NaN       NaN  ...          NaN       NaN     NaN

[21607 rows x 8 columns]

In [19]:
df.columns

Index(['id', 'date', 'price', 'bedrooms', 'bathrooms', 'sqft_living',
       'sqft_lot', 'floors'],
      dtype='object')

In [23]:
df.price

0        221900.0
1        538000.0
2        180000.0
3        604000.0
4        510000.0
           ...
21602         NaN
21603         NaN
21604         NaN
21605         NaN
21606         NaN
Name: price, Length: 21607, dtype: float64

In [24]:
df[['price','bedrooms','bathrooms']]

          price  bedrooms  bathrooms
0      221900.0       3.0       1.00
1      538000.0       3.0       2.25
2      180000.0       2.0       1.00
3      604000.0       4.0       3.00
4      510000.0       3.0       2.00
...         ...       ...        ...
21602       NaN       NaN        NaN
21603       NaN       NaN        NaN
21604       NaN       NaN        NaN
21605       NaN       NaN        NaN
21606       NaN       NaN        NaN

[21607 rows x 3 columns]

In [26]:
df.price.max()
df.price.mean()

520076.31313131313

In [27]:
df.fillna(0,inplace=True)
df.price.mean()

2382.9108622205767

In [28]:

df['price'].replace(to_replace = np.nan, value = 0, inplace = True)

In [29]:
df.price.isnull().sum()

0

In [30]:
df.price.sum()

51487555.0

In [31]:
df.bathrooms.count()

21607

In [32]:
df.bathrooms.unique()

array([1.  , 2.25, 3.  , 2.  , 4.5 , 1.5 , 2.5 , 1.75, 2.75, 3.25, 4.  ,
       0.  ])

In [33]:
df.bathrooms.value_counts()

0.00    21508
2.50       23
1.00       22
1.75       16
2.25       10
1.50        8
2.00        7
2.75        5
3.25        3
3.00        3
4.50        1
4.00        1
Name: bathrooms, dtype: int64

In [34]:
df[df.price == df.price.max()]

              id             date      price  ...  sqft_living  sqft_lot  floors
21  2.524049e+09  20140826T000000  2000000.0  ...       3050.0   44867.0     1.0

[1 rows x 8 columns]

In [35]:
df.set_index('date', inplace=True)

In [36]:
df.loc['20141013T000000']

                           id     price  ...  sqft_lot  floors
date                                     ...
20141013T000000  7.129301e+09  221900.0  ...    5650.0     1.0
20141013T000000  4.036801e+09  380000.0  ...    7300.0     1.0

[2 rows x 7 columns]

In [37]:
df.reset_index(inplace=True)

In [38]:
df.set_index('bathrooms', inplace=True)

In [40]:
df.rename(columns = {'date':'Dates'}, inplace = True)

In [41]:
df.head()

                     Dates            id  ...  sqft_lot  floors
bathrooms                                 ...
1.00       20141013T000000  7.129301e+09  ...    5650.0     1.0
2.25       20141209T000000  6.414100e+09  ...    7242.0     2.0
1.00       20150225T000000  5.631500e+09  ...   10000.0     1.0
3.00       20141209T000000  2.487201e+09  ...    5000.0     1.0
2.00       20150218T000000  1.954401e+09  ...    8080.0     1.0

[5 rows x 7 columns]

In [43]:
dummies = pd.get_dummies(df.bedrooms)

In [44]:
df = pd.concat([df,dummies],axis='columns')

In [46]:
df = df.drop(['bedrooms'], axis='columns')
df

                     Dates            id     price  ...  3.0  4.0  5.0
bathrooms                                           ...
1.00       20141013T000000  7.129301e+09  221900.0  ...    1    0    0
2.25       20141209T000000  6.414100e+09  538000.0  ...    1    0    0
1.00       20150225T000000  5.631500e+09  180000.0  ...    0    0    0
3.00       20141209T000000  2.487201e+09  604000.0  ...    0    1    0
2.00       20150218T000000  1.954401e+09  510000.0  ...    1    0    0
...                    ...           ...       ...  ...  ...  ...  ...
0.00                     0  0.000000e+00       0.0  ...    0    0    0
0.00                     0  0.000000e+00       0.0  ...    0    0    0
0.00                     0  0.000000e+00       0.0  ...    0    0    0
0.00                     0  0.000000e+00       0.0  ...    0    0    0
0.00                     0  0.000000e+00       0.0  ...    0    0    0

[21607 rows x 11 columns]

In [48]:
df1=df.copy()

In [54]:
train = df1.sample(frac=0.5, random_state=1)

In [55]:
train

          Dates   id  price  sqft_living  sqft_lot  ...  0.0  2.0  3.0  4.0  5.0
bathrooms                                           ...
0.0           0  0.0    0.0          0.0       0.0  ...    1    0    0    0    0
0.0           0  0.0    0.0          0.0       0.0  ...    1    0    0    0    0
0.0           0  0.0    0.0          0.0       0.0  ...    1    0    0    0    0
0.0           0  0.0    0.0          0.0       0.0  ...    1    0    0    0    0
0.0           0  0.0    0.0          0.0       0.0  ...    1    0    0    0    0
...         ...  ...    ...          ...       ...  ...  ...  ...  ...  ...  ...
0.0           0  0.0    0.0          0.0       0.0  ...    1    0    0    0    0
0.0           0  0.0    0.0          0.0       0.0  ...    1    0    0    0    0
0.0           0  0.0    0.0          0.0       0.0  ...    1    0    0    0    0
0.0           0  0.0    0.0          0.0       0.0  ...    1    0    0    0    0
0.0           0  0.0    0.0          0.0       0.0  ...    1    0    0    0    0

[10804 rows x 11 columns]